Revit 2027 API
DisplacementElement.SetDisplacedElementIds Method
 Sets the ids of the elements affected by this DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDisplacedElementIds(
	ICollection<ElementId> displacedElemIds
)
Public Sub SetDisplacedElementIds (
	displacedElemIds As ICollection(Of ElementId)
)
public:
void SetDisplacedElementIds(
	ICollection<ElementId^>^ displacedElemIds
)
member SetDisplacedElementIds :
        displacedElemIds : ICollection<ElementId> -> unit
Parameters
displacedElemIds ICollection<ElementId>
 Set of ids of elements to be displaced by this DisplacementElement.
Exceptions
Exception | Condition
ArgumentException |  For each individual element in the set displacedElemIds, isAllowedAsDisplacedElement must return true, and the elements must not already be displaced in the specified view.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace